20201101
1. 全书概览
    C语言版本：C99/C89
    四个部分：
        1. 基础特性
        2. 高级特性
        3. 标准库
        4. 参考资料
2. C语言的前世今生
    1. 诞生：
        时间：1970初
        地点：美 贝尔实验室
        事件：K和R开发Unix系统的副产物
    2. 发展
        经典C：K&R的《The C Programming Language》作为白皮书
        C89/C90
        C99
        C11，作为最新版本
3. 其他：
    1. C模糊码大赛：www.ioccc.org


20201102
1. C语言基本概念
    0. C程序产生过程
        1. C语言代码-预编译-编译-链接-机器码交给计算机执行
        2. 编译器：
            了解GCC编译器
    1. 指令
        1. 预处理器
            1. 预处理器的工作原理：读取指令-执行指令操作:修改源代码，包含或者替换
            2. 预处理指令
                1. 文件包含
                2. 宏定义
                    #define PI 3.14159
                    #undef 
                3. 条件编译
    2. 函数
    3. 语句
    4. 变量
    5. 注释





















